                                        
                                IC Compiler (TM)
                              IC Compiler-PC (TM)
                              IC Compiler-XP (TM)
                              IC Compiler-DP (TM)
                              IC Compiler-AG (TM)
                                        
               Version K-2015.06-SP1 for linux64 - Jul 15, 2015 
                                        
                    Copyright (c) 1988 - 2015 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
source setup.tcl
set begintime [clock seconds]
1481240899
open_mw_lib ./work
Error: Cannot open library ./work for write. (MW-006)
open_mw_cel ${modname}_init
Warning: Tries to open a Milkyway library whose name is the current working directory. (MWUI-136)
Error: Cannot open library  for write. (MW-006)
place_opt -effort high -optimize_dft -congestion -continue_on_missing_scandef
Error: Current design is not defined. (UID-4)
0
legalize_placement -effort high -incremental 
Error: Current design is not defined. (UID-4)
0
set_fix_multiple_port_nets -all -buffer_constants
Error: Current design is not defined. (UID-4)
0
place_opt -effort high -optimize_dft -congestion -continue_on_missing_scandef
Error: Current design is not defined. (UID-4)
0
legalize_placement -effort high -incremental 
Error: Current design is not defined. (UID-4)
0
preroute_standard_cells -nets VSS -connect horizontal
Error: Current design is not defined. (UID-4)
preroute_standard_cells -nets VDD -connect horizontal
Error: Current design is not defined. (UID-4)
verify_pg_nets  -pad_pin_connection all
Error: Current design is not defined. (UID-4)
report_timing
Error: Current design is not defined. (UID-4)
0
save_mw_cel -as ${modname}_placed
Error: Cannot get cellId for the current design. (UIG-2)
0
set endtime [clock seconds]
1481240901
set timestr [timef [expr $endtime-$begintime]]
0h 0m 2s
puts "run_place.tcl completed successfully (elapsed time: $timestr actual)"
run_place.tcl completed successfully (elapsed time: 0h 0m 2s actual)
exit

Thank you...
Exit IC Compiler!
